import React from 'react'
import { List, ListItem } from 'react-native-elements'
import { AppRegistry, StyleSheet, Text, View, ScrollView, Alert, Image, ListView } from 'react-native'
import Sound from 'react-native-sound'
import { Actions } from 'react-native-router-flux'

const list = [
    {
        level: 0,
        title: 'ไม่เคลื่อนไหวร่างกาย (นอนอยู่บนเตียง)',
        subtitle: 'บุคลากรเป็นผู้พลิกตัวและออกกำลังกายให้ ผู้ป่วยไม่มีการขยับร่างกายเอง'
    },
    {
        level: 1,
        title: 'นั่งบนเตียง ออกกำลังกายบนเตียง',
        subtitle: 'ทำกิจกรรมบนเตียง ประกอบด้วย การพลิกตัว การออกกำลังกายด้วยตัวเอง ไม่มีการขยับร่างกายนอกเตียง หรือเกินขอบเตียง'
    },
    {
        level: 2,
        title: 'มีผู้ช่วยเหลือผู้ป่วยมานั่งบนเก้าอี้ (ไม่ยืน)',
        subtitle: 'ยก อุ้ม หรือใช้กระดานเคลื่อนย้ายไปที่เก้าอี้ โดยไม่มีการยืนหรือนั่งที่ขอบเตียง'
    },
    {
        level: 3,
        title: 'นั่งที่ขอบเตียง',
        subtitle: 'อาจมีบุคลากรช่วย เกี่ยวข้องกับการทำกิจกรมที่นั่งทำที่ขอบเตียง'
    },
    {
        level: 4,
        title: 'ยืนที่ข้างเตียง',
        subtitle: 'ลงน้ำหนักที่เท้าทั้ง 2 ข้างในการยืน โดยมีหรือไม่มีบุคลากรช่วย อาจรวมไปถึงการยืนที่ใช้อุปกรณ์ช่วย'
    },
    {
        level: 5,
        title: 'สามารถย้ายจากเตียงไปนั่งที่เก้าอี้ได้',
        subtitle: 'สามารถก้าวหรือลากเท้าจากท่ายืนไปนั่งที่เก้าอี้ได้ รวมถึงการลงน้ำหนักเท้า 1 ข้าง แล้วจับอุปกรณ์อื่นเพื่อเคลื่อนไปนั่งที่เก้าอี้ ไม่นับรวมอุปกรณ์ที่มีล้อในการช่วยเคลื่อนย้าย'
    },
    {
        level: 6,
        title: 'ก้าวขา ย่ำเท้าที่ข้างเตียงได้',
        subtitle: 'สามารถเดินโดยยกเท้าจากพื้นได้อย่างน้อย 4 ก้าว หรือก้าวเท้าข้างละ 2 ก้าว โดยมีการช่วยเหลือหรือไม่ก็ได้'
    },
    {
        level: 7,
        title: 'สามารถเดินได้โดยมีผู้ช่วยเหลือ 2 คนหรือมากกว่า',
        subtitle: 'เดินจากเตียงหรือเก้าอี้อย่างน้อย 5 เมตร มีคนช่วย 2 คนหรือมากกว่า'
    },
    {
        level: 8,
        title: 'สามารถเดินได้โดยมีผู้ช่วยเหลือ 1 คน',
        subtitle: 'เดินจากเตียงหรือเก้าอี้อย่างน้อย 5 เมตร มีผู้ช่วยเหลือ 1 คน'
    },
    {
        level: 9,
        title: 'สามารถเดินได้เองโดยมีอุปกรณ์ช่วย',
        subtitle: 'เดินจากเตียงหรือเก้าอี้อย่างน้อย 5 เมตร มีอุปกรณ์ช่วยแต่ไม่มีผู้ช่วยเหลือ'
    },
    {
        level: 10,
        title: 'สามารถเดินได้เอง',
        subtitle: 'เดินจากเตียงหรือเก้าอี้อย่างน้อย 5 เมตร โดยไม่มีการช่วยเหลือ'
    },
    {
        level: 11,
        title: 'การไออย่างมีประสิทธิภาพ (Effective cough) ',
        subtitle: `     
                    1. จัดท่าให้นอนหัวสูง (Fowlers position) หรือนั่งบนเก้าอี้ กอดหมอนหรือผ้าห่มไว้บริเวณหน้าท้องหรือพยุงบริเวณที่มีแผล ก้มหน้าให้ไหล่โค้งเล็กน้อย ในกรณีที่ไม่มีหมอนอาจใช้ฝ่ามือทั้งสองข้างกดเบาๆ ด้านข้างของแผลเพื่อลดปวดและป้องกันแผลแยก 
                    2. หายใจเข้าออกลึกๆช้าๆ 2-3 ครั้ง จากนั้นหายใจเข้าลึกๆ และกลั้นหายใจไว้ประมาณ 1-2 วินาที จากนั้นให้ไอออกมาแรงๆโดยใช้แรงดันจากช่องท้องร่วมกับกล้ามเนื้อช่วยหายใจอื่นๆ เสมหะจะหลุดออกมาได้ง่ายขึ้น 
                    กรณีไม่มีเสมหะ ก็ต้องฝึกไอหลังผ่าตัด เพื่อหวังผลให้หน้าอกมีการสั่นสะเทือน ส่งผลให้เสมหะที่อยู่ในถุงลมปอดหลุดออกมาและดูดซึมได้ง่ายขึ้น
                   3. ทำซ้ำเพื่อให้เสมหะหลุดออกมา และกระตุ้นให้เกิดการไอบ่อยๆ เพื่อป้องกันภาวะแทรกซ้อนที่อาจจะเกิดตามมา เช่นภาวะอักเสบ, ปอดแฟบ 
`
    },
    {
        level: 12,
        title: 'การหายใจเข้าออกยาวๆ ลึกๆ (Deep-breathing exercises)',
        subtitle: `     
                    1. ให้ผู้ป่วยนั่งตัวตรงที่ข้างเตียง หรือช่วยให้อยู่ในท่า semi-Fowler’s position 
                    2. ใช้มือทั้งสองข้างจับที่ท้องจะได้รู้สึกเวลาหน้าอกขยายจะบ่งชี้ว่าปอดขยายตัว
                   3. ให้ผู้ป่วยหายใจเข้าทางจมูกจนรู้สึกว่าหน้าท้องขยาย
                   4. ให้ผู้ป่วยหายใจทางปากขณะกล้ามเนื้อหน้าหน้าท้องหดตัว
                   5. ทำแบบนี้ซ้ำทุกชั่วโมงในวันแรกหลังผ่าตัด 
`
    },
    {
        level: 13,
        title: 'การใช้สไปโรมิเตอร์ (Incentive spirometer) ',
        subtitle: `     
                    เพื่อขยายถุงลมในปอดหลังผ่าตัดให้เป่าถึงระดับที่ตั้งไว้ให้ปอดขยายตัว วิธีนี้ช่วยให้ลมเข้าไปในถุงลมและช่วยทำให้กล้ามเนื้อที่ช่วยในการหายใจแข็งแรง ซึ่งกล้ามเนื้อนี้จะอ่อนแรงในขณะที่ได้รับยาสลบ ผู้ป่วยควรฝึกใช้เครื่องช่วยหายใจทั้งก่อนและหลังผ่า ส่วนมากสอนให้ผู้ป่วยทำ 5-10 ครั้งต่อชั่วโมงหลังผ่าตัด 
`
    },
    {
        level: 14,
        title: 'การออกกำลังกายแขน-ขา (Extremity exercises) ',
        subtitle: `     
                    ช่วยป้องกันปัญหาเกี่ยวกับกรไหลเวียนโลหิต ช่วยให้เลือดดำไหลกลับสู่หัวใจดีขึ้น สอนให้ผู้ป่วยงอและเหยียดข้อต่างๆทุกข้อ โดยเฉพาะข้อสะโพก ข้อเข่า ข้อเท้าขณะนอนราบหลังและขาอยู่แนวราบเหยียดตรงเท้าต้องหมุนเป็นวงกลมขณะนอนหรือนั่ง กระตุ้นให้ทำก่อนผ่าตัดเพื่อความคุ้นเคยและนำไปใช้หลังผ่าตัด 
`
    },
    {
        level: 15,
        title: 'การพลิกตัว (Turning exercises)',
        subtitle: `     
                    หัดพลิกตัวจากด้านหนึ่งไปอีกด้าน โดยใช้ไม้กั้นเตียงช่วยในการพลิกตัว การพลิกตัวช่วยป้องกันการคั่งของเลือดดำ หลอดเลือดดำอุดตัน แผลกดทับและอาการแทรกซ้อนในระบบทางเดินหายใจ ควรพลิกตัวและเปลี่ยนท่านอนบนเตียงทุก 1-2 ชั่วโมง ในระยะหลังผ่าตัด 
`
    }
]

export default class Activity1AdvicesList extends React.Component {

    onPress = (i) => {
        // let obj = list[i]
        // Actions.tab_advices_activity_1_detail({ activity: obj })
        let level = list[i].level
        let title = list[i].title
        let subtitle = list[i].subtitle
        Actions.tab_advices_activity_1_detail({ level, title, subtitle })
    }

    render() {
        return (
            <ScrollView>
                <List>
                    {
                        list.map((item, i) => (
                            <ListItem
                                key={i}
                                title={item.level <= 10 ? <Text style={styles.item}>ระดับ {item.level}   {item.title}</Text> : <Text style={styles.item}>{item.title}</Text>}
                                titleStyle={styles.item}
                                onPress={() => this.onPress(i)}
                            />
                        ))
                    }
                </List>
            </ScrollView>
        )
    }
}

const styles = StyleSheet.create({
    item: {
        padding: 10,
        fontSize: 20,
        height: 50,
    }
})